#pragma once
#define _CRT_SECURE_NO_WARNINGS
//#define p = 3.14 // просто константа
#include <iostream> // используетс€ объекты cin, cout, cerr и clog дл€ передачи информации и из стандартных потоков ввода, вывода, 
// ошибок без буферизации и ошибок с буферизацией соответственно
#include <stdio.h> // определени€ макросов, константы и объ€влени€ функций и типов,
	// используемых дл€ различных операций стандартного ввода и вывода
#include <cstdlib> // генерации случайных чисел, целой арифметики, поиска, сортировки и преобразовани€ типов данных
#include <stdlib.h> // дл€ преобразований и работы с динамической пам€тью
#include <fstream> // дл€ работы с файлами
#include <string> // дл€ работы со строками
#include <time.h>  // подкл времени
#include <cmath> // дл€ работы с корн€ми и степен€ми
#include <iomanip> // дл€ манипул€ций с in/out-put
#include <sstream> // дл€ конвертации чисел в строки (char[])
#include <fstream> // дл€ рабрты с файлами
#include <queue> // дл€ работы с функци€мт STL queue(тип списков)
#include <vector> //std::vector<T> Ч реализаци€ динамического массива
#include <stack> // абстрактный тип данных, представл€ющий собой список элементов, 
// организованных по принципу Ђпоследним пришЄл Ч первым вышелї
#include<set> //дл€ работы с "деревь€ми"
#include"Date.h"

using namespace std; //сообщает компил€тору, что мы хотим использовать всЄ, что находитс€ в пространстве имен std,
	// так что, если компил€тор найдет им€,которое не сможет распознать,
	//он будет провер€ть его наличие в пространстве имен std
